---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PerformanceAdviserRuleId
source: html/470e6070-ed9a-d25a-3347-796ab6db4269.htm
---
# PerformanceAdviserRuleId Members

Creates a new PerformanceAdviserRuleId instance.